[{"EventID": "", "TalkTitle": "Where's My Beer: How I Built a Better Kegerator with a Raspberry Pi and Sensu", "Room": "", "startTime": "14:45", "Date": "6-9", "FullName": "Aaron Sachs", "Talkdescription": "As a home brewer and lover of malt, I'm always disappointed when I unexpectedly get to the last drop of beer in my kegs. Being a Linux geek, I thought to myself, \"Wait, why don't I see if I can monitor my kegerator using a Raspi and some open source software to keep better track of how much is left so I'm not surprised when I reach the end of a keg?\" This is my journey to building a better mousetrap, er, kegerator and using open-source tools to do so."}, {"EventID": "", "TalkTitle": "Automating your Red Team Infrastructure", "Room": "", "startTime": "10:15", "Date": "6-10", "FullName": "Alex Rodriguez", "Talkdescription": "# apt-get update && # apt-get upgrade -y && # apt-get dist-upgrade -y...here we go again...and it failed...alright reinstall...\nI hate waiting for two hours when this process goes on. So in this talk I will show you how to keep your red teaming boxes up to date (automatically with packer). Then all you have to do is download a new image with vagrant box update to pull down the new image, and vagrant up to provision it (with ansible and also bash) how you like to and start up a fully updated box. Take the automation infrastructure to a new level for you red team or blue team. (This talk will specifically use Kali and other images for red teaming, but the sky is the limit even if you aren't a red teamer.)"}, {"EventID": "", "TalkTitle": "Copyright, Open-source, Free Market and the history of MySQL", "Room": "", "startTime": "", "Date": "", "FullName": "Alexander Rubin", "Talkdescription": "This is a story of how one idea - GPL software license - has created a whole new business model and allowed the creation of the most popular opensource database - MySQL.\nI've joined MySQL, Inc (a company behind MySQL database) in 2006. I will share some less known MySQL history (i.e. forgotten MySQL projects like Drizzle), MySQL artifacts, etc.  On the example of MySQL I will discuss how GPL influenced copyright, anti-copyright, opensource, free market and private property, free software foundation.\nThis is also a story of how GPL created a new and stronger copyright: by forcing the code to only be distributed under GPL/opensource terms, it also forced the companies to buy the code under proprietary license if they plan to use it commercially. "}, {"EventID": "TEST_ID_1", "TalkTitle": "Silence is Deadly", "Room": "BallroomA", "startTime": "13:30", "Date": "6-9", "FullName": "Amanda Folson", "Talkdescription": "For every 2 homicides committed in the United States there are 3 suicides. Perhaps more alarmingly, 40,000+ people in the US alone will lose their battle with depression this year. The tech industry in particular is plagued with mental health stigma as companies push employees to perform and employees push themselves to stay up to date on the latest tech. When problems arise, no one wants to admit that something’s wrong out of fear of losing their job, their livelihood, or even their friends and family. It’s time to end the stigma surrounding mental health and start encouraging those who are struggling to seek help. More importantly, we need to let those who struggle know they’re not alone -- this starts with us. In this talk we will discuss the state of mental health around the world, how we can get comfortable talking about it, and what we can do to change the way we talk about mental health to save lives."}, {"EventID": "", "TalkTitle": "Perl 6 and the Emergent Program.*", "Room": "", "startTime": "", "Date": "", "FullName": "Bruce Gray", "Talkdescription": "[Quip]: Like vegetables snuck in to a meatloaf, Perl 6 makes tasty a few very advanced CompSci tools, via clever syntax that masks the complex and dangles the shiny.\n\n[Real description]: Perl 6 is a top-tier tool for exploratory programming, and for educating programmers. Through smart syntax choices, it offers up advanced Math and CompSci techniques while packaging them as compact tools, which makes those techniques less daunting and more interesting. These tools let you think and code faster in under-defined problem domains."}, {"EventID": "TEST_ID_42", "TalkTitle": "K2P1 or How Your Programming Language Evolved from Knitting", "Room": "BallroomA", "startTime": "9:00", "Date": "6-10", "FullName": "Carrie Stokes and David Stokes", "Talkdescription": "The first truly popular programmed device was a loom for making cloth.  From those beginnings many echos can still be found in your programming language today. This session will explore the fascinating overlap between skills like knitting and computer programming.  There are also overlaps between the fiber communities and open source communities.  The mentoring and educational paths for both fiber and FOSS take slightly different tracks but there are many potential synergies for those who wish to paradigm with using the clutch.  We will explore how the Internet has impacted knitting, why the Finnish are teaching knitting to children before coding, and the true definition of getting stuck in a loop. "}, {"EventID": "", "TalkTitle": "Introducing the MySQL Document Store", "Room": "", "startTime": "10:15", "Date": "6-8", "FullName": "Charles Bell, PhD", "Talkdescription": "Are you a fan of MySQL but have always wanted to leverage NoSQL in your applications? Until recently, that simply wasn't possible. However, the new MySQL Document Store feature support both SQL and NoSQL database paradigms. Don’t allow yourself to be forced into one paradigm or the other, but combine both approaches by using the Document Store feature that is new in MySQL 8!\n\nThis talk presents a host brand new tools and features that make creating a pure SQL, hybrid, or NoSQL solution far easier than ever before. Topics include a look at the components that make up the Document Store, using JSON documents with relational data, and building pure NoSQL solutions. You'll learn everything you need to get starting writing NoSQL applications for MySQL."}, {"EventID": "", "TalkTitle": "Introducing MySQL InnoDB Cluster", "Room": "", "startTime": "16:00", "Date": "6-8", "FullName": "Charles Bell, PhD", "Talkdescription": "Are you using MySQL in a high availability environment or maybe want to make your existing MySQL installation highly available? If you've tried it on your own, you may have had great success but with a higher than expected configuration and maintenance burden. That all changes with InnoDB Cluster. Do you want a single writer and many readers? Do you want multiple writers and readers? MySQL InnoDB Cluster can solve these problems and more.\n\nThis talk introduces the latest evolution of high availability features in MySQL, namely, the InnoDB Cluster and Group Replication. You will learn what comprises the InnoDB Cluster including how to quickly configure and maintain your cluster with the new MySQL Shell. You will also see the many benefits of using InnoDB Cluster including automatic failover and advanced replication configurations."}, {"EventID": "", "TalkTitle": "Simplifying your IT workflow with Katello and Foreman", "Room": "", "startTime": "14:45", "Date": "6-10", "FullName": "Chris Roberts", "Talkdescription": "As your organization grows, so does your workload—and the IT resources required to manage it. There is no \"one-size-fits-all\" system management solution, but a centralized, open source tool such as Foreman can help you manage your company's IT assets by provisioning, maintaining, and updating hosts throughout the complete lifecycle.\n\nForeman is an open source project that helps system administrators manage servers throughout their lifecycle, from provisioning and configuration to orchestration and monitoring. Using Puppet, Chef, Salt, Ansible and Foreman’s smart proxy architecture, you can easily automate repetitive tasks, quickly deploy applications, and proactively manage change, both on-premise with VMs and bare-metal or in the cloud."}, {"EventID": "", "TalkTitle": "Understanding the licensing of your database stack", "Room": "", "startTime": "16:00", "Date": "6-9", "FullName": "Colin Charles", "Talkdescription": "What happens when a critical piece of database infrastructure gets relicensed? What alternatives do you have? databases are really for long term storage, and is your data protected for the foreseeable future? This talk will be largely focused on the MySQL ecosystem, in where you not only have software that is licensed traditionally with the GPLv2, GPLv3, but also a new Business Source License. \n\nIf you're a MariaDB MaxScale or MariaDB ColumnStore user, you'll definitely want to be in this talk, as it focuses on the changes and what you might be paying for. Remember, just being able to see the source code does not a license grant you!\n\nSee how MySQL (at Oracle) and Percona continue to do it right. There will be a discussion around some other popular OSS databases too."}, {"EventID": "", "TalkTitle": "The MySQL Ecosystem - understanding it, not running away from it!", "Room": "", "startTime": "11:30", "Date": "6-9", "FullName": "Colin Charles", "Talkdescription": "MySQL is unique in many ways. It supports plugins. It supports storage engines. It is also owned by Oracle, thus birthing two branches of the popular opensource database: Percona Server and MariaDB. It also spawned a fork: Drizzle. You're a busy DBA having to maintain a mix of this. Or you're a CIO planning to choose one branch. How do you go about picking? Supporting multiple databases? Find out more in this talk.\n\nMySQL is a unique adult in many ways. It supports plugins. It supports storage engines. It is also owned by Oracle, thus birthing a branch and fork of the popular opensource database: Percona Server and MariaDB Server.\n\nYou're a busy DBA thinking about having to maintain a mix of this. Or you're a CIO planning to choose one branch over another. How do you go about picking? Supporting multiple databases? Find out more in this talk. Also covered is a deep-dive into what feature differences exist between MySQL/Percona Server/MariaDB Server. Within 20 minutes, you'll leave informed and knowledgable on what to pick.\n\nA base blog post to get started: https://www.percona.com/blog/2017/11/02/mysql-vs-mariadb-reality-check/"}, {"EventID": "", "TalkTitle": "MySQL/Percona Server/MariaDB Server security features overview", "Room": "", "startTime": "9:00", "Date": "6-9", "FullName": "Colin Charles", "Talkdescription": "With MySQL 8, security models have changed (and they have been getting better since 5.6 & 5.7). This means there is diversion with MariaDB Server 10.0 and greater (being a fork). The bonus is that Percona Server for MySQL is quite close to MySQL (being a branch), but there are also security enhancements that one could benefit from. Come learn about them in this quick overview. \nSome topics covered, but not limited to:\n- Using TLS/SSL for connections\n- Using TLS/SSL with MySQL replication\n- Using external authentication plugins (LDAP, PAM, Kerberos)\n- Encrypting your data at rest \n- Monitoring your database with the audit plugins\n- Roles"}, {"EventID": "", "TalkTitle": "Talk Around the World with DMR", "Room": "", "startTime": "11:30", "Date": "6-9", "FullName": "Darrell Little - KI4LLA", "Talkdescription": "Using OpenSource software, Linux and a Raspberry Pi, you can create your own Digital Mobile Radio (DMR) hotspot and talk to other ham operators anywhere in the world."}, {"EventID": "", "TalkTitle": "MySQL Without the SQL -- On My!", "Room": "", "startTime": "13:30", "Date": "6-8", "FullName": "Dave Stokes", "Talkdescription": "Two percent of developers get any formal training in Structured Query Language and 98% percent wonder why their queries stink.  MySQL is introducing the Document Store to allow developers to code without needed to know SQL, define data structures, or involve a DBA. No longer do you need to embed an ugly string of SQL in your beautiful program.  The Document Store is built on the JSON data type and the new X DevAPI and even works with existing relational tables so you get the best of the NoSQL and SQL worlds on on proven technology platform."}, {"EventID": "", "TalkTitle": "MySQL Windowing Functions", "Room": "", "startTime": "14:45", "Date": "6-9", "FullName": "Dave Stokes", "Talkdescription": "MySQL 8 introduces Windowing Functions for better analytical queries.  You can now group multiple lines of data together (A time period, department, zipcode, etc.) and examine that group.  However this is an extremely complex tool that is not very well explained until now.  "}, {"EventID": "", "TalkTitle": "20 years of MySQL, 20 years of PHP, and 10 Years of SELF -- What the heck has been going on? ", "Room": "", "startTime": "9:00", "Date": "6-8", "FullName": "Dave Stokes", "Talkdescription": "So what are the lessons of using MySQL and PHP for over twenty years now that we have reached the tenth anniversary of the Southeast Linux Fest? Besides the moonshine night and geeks with guns, why do normally reasonable folks return year after year to Charlotte to gather around open source software. Now we put computer services in a container but can we can not contain pop up ads! We can store all sorts of stuff on Github but why do I still get spammers commenting on old MySpace pages?  And what year will really be the year of the Linux Desktop?  Did we need Meltdown to warn of of impeding doom or did that come with systemd?  So if you like odd, quirky views with plenty of snark pointed at the computer industry please attend.  "}, {"EventID": "", "TalkTitle": "Keynote:", "Room": "", "startTime": "16:00", "Date": "6-9", "FullName": "Dave Yates", "Talkdescription": ""}, {"EventID": "", "TalkTitle": "FOSS Governance: The good, the bad and the ugly", "Room": "", "startTime": "11:30", "Date": "6-9", "FullName": "Deb Nicholson", "Talkdescription": "There are lots of ideas out there about how to run a free and open source software project... but not all strategies were created equal. Sometimes governance \"just happens\" but more often than not, projects end up with some things that work and some that (really) don't. Unfortunately, by the time they regret some of the bad ideas they're baked into the project and harder to change. This talk will cover some of the big red flags you'll want to avoid as well as some of the less obvious stuff that most people discover \"the hard way.\" \n\nFiguring out when your idea is cohesive enough to bring people in but not so detailed that you're basically looking for clones of yourself, is a delicate dance. Transparency goes a long way towards helping you find people who support your vision but can still bring new ideas to the table when it comes time to talk implementation. Laying down a few rules or sharing some expectations early on can help you avoid a world of hurt and confusion later on. And of course, there are a few nitty gritty details (like licensing and naming) that are worth paying a little bit of special attention to in the beginning.\n\nMaintaining and scaling your project is easier when you've laid a good foundation. Join me for whirlwind tour of what not to do, what to do instead and *maybe* what you can do to fix what you've already done. The FOSS community has more than enough good, bad and ugly governance stories that you should at least make be able your own brand new mistakes.  "}, {"EventID": "", "TalkTitle": "LVM and MD RAID Tutuorial", "Room": "", "startTime": "14:45", "Date": "6-8", "FullName": "Dwain Sims", "Talkdescription": "In this talk we will take a more extended view of setting up and using a couple of more mysterious features of Linux, the Logical Volume Manager and its friend, MD RAID.  We will look at how to configure and take advantage of these storage related features that are becoming ever more important, especially with the advent of cloud based systems and  devices that cannot be used with Hardware RAID.\nWe will also be taking a look at how to best tune your Linux system when using MD RAID.  And there will be some discussion on the topic of displacing hardware RAID altogether in favor of software based techniques.  And finally, we will peer into the crystal ball and see what might be on the horizon as newer techniques to accomplish what LVM and MD do for us today.\n"}, {"EventID": "", "TalkTitle": "Rescuing Ancient Code", "Room": "", "startTime": "14:45", "Date": "6-8", "FullName": "Eric S. Raymond", "Talkdescription": "If you devote yourself to infrastructure maintenance, you're going to run into a lot of ancient code that's been undermaintained and fragile for a long. long time and needs fixing - maybe emergency fixing if it's sprung a security leak.  This talk - born from direct experience of several rescues - is about how you cope with hundreds of KLOC of ancient crufty C and what you generally have to do to clean it up.   Colorful war stories included."}, {"EventID": "", "TalkTitle": "UPSide: An adventure in open hardware", "Room": "", "startTime": "10:45", "Date": "6-10", "FullName": "Eric S. Raymond", "Talkdescription": "Back in February my discontent with the UPSes (Uninterruptable Power Supplies) that an individual can buy boiled over after a particularly trying failure at oh-dark-thirty on a Wednesday morning. I decided to fix the problem.  Over the next two weeks I recruited a group of equally disgusted engineers to help me design and build an open=source, open-hardware UPS designed although these things actually matter.\n\nThis talk is about the design of UPSide, the joys and terrors of combining open-source software with open-source hardware, how to design systems to minimize your risk of failure when you're a software guy inventing hardware, and what may be a novel mode of collaboration we discovered along the way."}, {"EventID": "", "TalkTitle": "AI: the future needs open source", "Room": "", "startTime": "11:30", "Date": "6-9", "FullName": "Francois Dion", "Talkdescription": "First, there was Eliza and Aaron. Many more came, nameless. And then there were many: Siri, Cortana, Alexa, Google Assistant and all the others. They might still be primitive, but due to a non linear increase in computing power, they won't stay that way... In the near future, much sooner than most people realize, many decisions made by government offices, businesses and even individuals will be made by an AI, and not by a human. Will they be fair or biased? Will people be able to appeal these decisions? And more importantly, will they provide reasons for these decisions?\n\nThis talk will explain how Linux and the Open Source community can play a significant role in this future, and an alternative to a world where all AI are closed source black boxes controlled by a few corporations."}, {"EventID": "", "TalkTitle": "Intro to Sensu", "Room": "", "startTime": "13:30", "Date": "6-9", "FullName": "Garrett Honeycutt", "Talkdescription": "Sensu is an open source monitoring solution built for today's environments. Kubernetes, Sensu allows you to get complete visibility of your infrastructure and software. Besides monitoring, it also does alerts and metrics routing and ties into tools you might already use. You will leave understanding how Sensu works and how to quickly get started using it."}, {"EventID": "", "TalkTitle": "Dr. Strangeways or: How I Learned to Stop Worrying and Love ECMAScript", "Room": "", "startTime": "14:45", "Date": "6-10", "FullName": "Ian Geiser", "Talkdescription": "Since it's inception Javascript has been seen as a bad idea.  Duck typing, except when it's not.  Object-oriented, except when it's not.  Functional, except when it's not.  Scoping nightmares that make the most seasoned of developers cry.  Still, with all of this going against it as a language it has persevered.  This talk will cover some history, some commentary and what has changed to make Javascript, or ECMAScript as it is now known, a less bad idea."}, {"EventID": "", "TalkTitle": "On Encrypting Email With GnuPG", "Room": "", "startTime": "11:30", "Date": "6-10", "FullName": "James Richardson", "Talkdescription": "Encrypting email with GnuPG keeps it private and away from bulk surveillance. I will show breifly how to create a GnuPG key pair and configure Thunderbird/enigmail, mutt and emacs mail user agents to do send and receive encrypted email. "}, {"EventID": "", "TalkTitle": "The Absolute Bare Minimum You Need to Know to Use Vim", "Room": "", "startTime": "10:15", "Date": "6-9", "FullName": "Jās Eckard", "Talkdescription": "Have you ever accidentally been thrown into Vim when editing a crontab, sudoers file, or git commit?  Have you ever pasted into Vim and completely ruined the file?  Simply follow this one weird trick.  Prepare to be shocked.  The end will surprise you.  Uh, ...they don't want you to know.  Seriously, this is the absolute bare minimum you need to know to use Vim."}, {"EventID": "", "TalkTitle": "A Deep Dive Into the Linux Infrastructure of an Engineering College", "Room": "", "startTime": "11:30", "Date": "6-10", "FullName": "Jason Edgecombe", "Talkdescription": "We’ll cover the main technologies, tools, and methods we use to manage Linux workstations, servers, and users."}, {"EventID": "", "TalkTitle": "Monolith to Microservice: pitch forks not included", "Room": "", "startTime": "10:15", "Date": "6-10", "FullName": "Jason Plum", "Talkdescription": "GitLab's cloud native project brought many challenges, and several pain points to light. Jason brings his experiences turning the Omnibus GitLab into cloud native Helm charts by way of containerization and orchestration, and finding lots of latent technical debt. This will cover the hows, whys, and how on earths. #HowHardCanItBe #docker #kubernetes #ThoughtWeFixedThat"}, {"EventID": "", "TalkTitle": "GnuPG in corporate environment - best practices", "Room": "", "startTime": "13:30", "Date": "6-10", "FullName": "Jean Pierre LeJacq", "Talkdescription": "GnuPG and the OpenPGP standard are the default encryption, signing, and key management software in the open source community. It is used for user authentication, email encryption, git commit signing, assuring integrity package management systems, and of document encryption.\n\nIn this talk we discuss best practices for using GnuPG in a corporate environment. We outline best practices for key management including proper creation of keys, revocation management, guaranteeing access to all encrypted corporate communication. The is an intermediate to advance talk that discuss many of the latest features of GnuPG."}, {"EventID": "", "TalkTitle": "Best practices in C/C++ tool chain for improving security and quality", "Room": "", "startTime": "", "Date": "", "FullName": "Jean Pierre LeJacq", "Talkdescription": "C/C++ developers for embedded, IoT and HPC have never had better quality tools and language evolution for improving the quality and security of the software they write. This has been driven primarily by the open source projects such as clang, gcc, valgrind, and many others. However, taking full advantage of  these tools can be a daunting tasks.\n\nThis presentation provides an overview of best practices for maximizing the compilers, test frameworks, and instrumentation. We focus on how to combine the various tools such as the run-time sanitizers (address, thread, undefined behavior), fuzzers, and linters along with various compilation models. "}, {"EventID": "", "TalkTitle": "Keynote: From The Desk of the Lead Masochist", "Room": "", "startTime": "17:15", "Date": "6-9", "FullName": "Jeremy Sands", "Talkdescription": ""}, {"EventID": "", "TalkTitle": "ZFS and MySQL on Linux, The Sweet Spots", "Room": "", "startTime": "10:15", "Date": "6-9", "FullName": "Jervin Real", "Talkdescription": "ZFS is the most advanced filesystem and volume management while MySQL is the most popular open source relational database. Within these ranks though, the two may not always be the best match. Percona's Jervin and Yves Trudeau has explored the use cases, configuration options, and strengths and weakneses. We find and lay out the sweet spots so you don't have to."}, {"EventID": "", "TalkTitle": "The Turkey's Egg", "Room": "", "startTime": "14:45", "Date": "6-9", "FullName": "Jim Salter", "Talkdescription": "This is a story of how I got rolled up like a rug by an offshore hacker back in 2011, and learned the importance of infosec best practices as a result. The title is an homage to Cliff Stoll's book \"The Cuckoo's Egg\" - but I'm a lot less heroic. Come to laugh, stay to learn, and hopefully don't get pwnt down the road."}, {"EventID": "", "TalkTitle": "The Sysadmin's Toolbox", "Room": "", "startTime": "10:15", "Date": "6-10", "FullName": "Jim Salter", "Talkdescription": "The Sysadmin's Toolbox: 20 command line utilities for true masters of the machine. You knew about some of them, heard about most of them, and wonder why you never heard of a few - but you *need* all of them in your life, whether you knew it or not."}, {"EventID": "", "TalkTitle": "Feeding Frenzy: Lessons From the FreeNAS Community", "Room": "", "startTime": "16:00", "Date": "6-9", "FullName": "Joshua Michael Smith", "Talkdescription": "My manager at iXsystems came to me one day and told me about a new  position that would be a perfect fit for me, the Community Administrator of the FreeNAS Forums. I thought to myself,  \"I've worked in website development for a while and I've managed forums in the past...what could possibly go wrong?\" She went on to say that the forums might be a little rough around the edges, but with the help of someone with a good attitude and peacekeeping skills, we could help steer things in the right direction. I jumped right in with both feet, eager to meet others in the community and expecting a warm welcome as the new Administrator in town. \n\nI did receive a welcome but it wasn't exactly warm. In fact, by the end of the first week, I had managed to upset the entire community moderation team. Find out what happened, some of the lessons we learned along the way, and how iXsystems is working with the FreeNAS Community today to build better BSD-based products."}, {"EventID": "", "TalkTitle": "Your Documentation sucks and you should feel bad", "Room": "", "startTime": "13:30", "Date": "6-10", "FullName": "JT Pennington", "Talkdescription": "Going over issues of documentation as a developer"}, {"EventID": "", "TalkTitle": "What is Old is New Again", "Room": "", "startTime": "9:00", "Date": "6-10", "FullName": "K.S. Bhaskar", "Talkdescription": "Circa 1970 was a creative time for computing. Along with UNIX, C and SQL, there was… MUMPS. It was an operating system, a file system, a database, and a programming language. You booted the machine into MUMPS, and the only way to exit MUMPS was to shutdown the machine. But it allowed minicomputers to affordably solve complex applications like healthcare that previously required expensive mainframes. Over the years MUMPS ceased to be the OS and the file system. Along the way its scalability and functionality led it to become the platform of record for several of the largest real-time core-banking systems in the world as well as the largest electronic health record system deployments. But the language and the database remained integrated.\n\nIn 2018, this changed. While you can still use MUMPS as a language integrated with a database, the database now has a C API that allows it to be tightly integrated with other languages, tight integration being key to achieving the level of scalability needed for the high end enterprise-scale transactional applications where MUMPS has excelled. Furthermore, YottaDB, an implementation of MUMPS, now runs on the Raspberry Pi Zero. It is thus possible to run a MUMPS database, with applications programmed in the language of your choice, in an entire Internet of Things stack, from devices and smart sensors to the cloud based systems that bring an IoT stack to life (e.g., see https://yottadb.com/use-cases/iot-application-brief/).\n\nThe speaker will present MUMPS, and discuss an application where the MUMPS database is used at different levels of an IoT stack, but with different applications in different tiers of the stack."}, {"EventID": "", "TalkTitle": "(Mis)using and Abusing APIs ", "Room": "", "startTime": "14:45", "Date": "6-10", "FullName": "Keith Casey", "Talkdescription": "Good news and bad news.\nThe good news is that people have found your API and are using it every day to accomplish amazing things. The bad news is those “amazing” things are illegal, compromise your internal systems, and you’re still not making money. While APIs have allowed us to accomplish wildly complex tasks with just a few lines of code, our mindset, policies, and practices haven’t kept up.\n\nLet’s take a walk on the dark side to understand exactly how bad things really are."}, {"EventID": "", "TalkTitle": "The Many Layers of OAuth", "Room": "", "startTime": "11:30", "Date": "6-8", "FullName": "Keith Casey", "Talkdescription": "OAuth is one of the most important but most misunderstood frameworks out there. What you think it is, it probably isn’t. What it actually is, you probably hadn’t considered. Regardless, when you consider the standards, specifications, and common practices interact and fit together, it’s impressive what you can accomplish with minimal effort.\n\nIn this session, we’ll explore through the most common RFCs that are combined to make powerful, robust, and secure solutions that drive modern software development."}, {"EventID": "", "TalkTitle": "Regex or Regular Expressions", "Room": "", "startTime": "14:45", "Date": "6-10", "FullName": "Kirk Carlson", "Talkdescription": "So you want to know how to harness the power of the Linux to search for text patterns in files. Regex is a mini language within many Linux tools that is used to specify search strings. This start of simple like find all occurrences of Rex Tillerson. Then it can be to find all Scandinavians named Rex. Then it could be to find a Scandinavians named R something with a doubled letter in their last name. This will talk about the basic syntax. How it is different for different tools ( vi, grep, sed). How to use a tool for expressing the syntax in English, since regex is generally considered to be a 'write-only' language."}, {"EventID": "", "TalkTitle": "Interviewing-Be So Good They Can't Ignore you", "Room": "", "startTime": "9:00", "Date": "6-8", "FullName": "Leveat Ruse", "Talkdescription": "Real life tips and tools to help you leave a positive impression during any kind of interview and help you land that role. "}, {"EventID": "", "TalkTitle": "Linux is the Wild West, and Let it Be That Way!", "Room": "", "startTime": "16:00", "Date": "6-9", "FullName": "Luke Smith", "Talkdescription": "Will the fabled \"Year of the Linux Desktop\" ever come? Luke makes the case for a less common strategy for Linux's future: a Wild West of extensible programs with a dash of UNIX philosophy, rather than mimicking the \"polished\" design principles of common operating systems. People are drawn to Linux as a platform not because it's similar to their familiar OS, but different, and expanding Linux means advertising those differences.\n\nHear the virtues (expected or otherwise) of plaintext, terminal tools and tiling window managers (and of course vim) for new users, and hear about how to easily narrow the gap between introductory Linux users and \"poweruser\" tools."}, {"EventID": "", "TalkTitle": " Herding Cats: Managing Users", "Room": "", "startTime": "9:00", "Date": "6-10", "FullName": "Marshall Mark Hamrick", "Talkdescription": "This talk covers the tips, techniques, and lessons learned while working with users in an academic environment who don’t follow standards for various (often legitimate) reasons. We’ll share our perspectives on how we keep the users in check without having managerial authority."}, {"EventID": "", "TalkTitle": "Orchestrating Multi-service Applications on Kubernetes", "Room": "", "startTime": "10:15", "Date": "6-9", "FullName": "Michael Hrivnak", "Talkdescription": "Many applications consist of multiple services, such as a database, API service, and frontend. Provisioning them as a single application in Kubernetes can be a challenge, especially if one or more services runs outside your cluster.\n\nThe Service Catalog provides a new way to publish, provision, and manage applications on Kubernetes through the use of Service Brokers. The Automation Broker allows users to leverage Ansible Automation to define and orchestrate simple to complex multi-service deployments.\nIn this session you will learn:\n- How to provision a multi-service application on Kubernetes using the Automation Broker.\n- How to include external service provisioning in your application’s deployment.\n- How to package Ansible Playbooks into a single meta-container for orchestrating the deployment of your application.\n- How to publish your own applications in the Kubernetes Service Catalog."}, {"EventID": "", "TalkTitle": "Taking care of the elephant", "Room": "", "startTime": "14:45", "Date": "6-8", "FullName": "Michael Meskes", "Talkdescription": "The Elephant Shed is an Open Source PostgreSQL Appliance that bundles and integrates proven components, required for easy management of a PostgreSQL server. Proven tools for all relevant aspects are already preinstalled and preconfigured. The majority of these tools can be controlled via a comfortable web interface. Even experienced PostgreSQL administrators will hardly find an area not covered by Elephant Shed PostgreSQL appliance.\n\nIt takes more than one piece of software to create a reliable and serviceable platform. There are different approaches to fill the gap, but usually Open Source offers all the bits and pieces needed. However, these need to be well integrated. Elephant Shed is such an integration of all the necessary tools for a high-performance PostgreSQL platform.\n\nThe wheel is not reinvented. Instead of new developments, established and reliable open source projects that fullfill the needs of the specific aspect are assembled into the Elephant Shed PostgreSQL appliance. These are integrated within a single user interface. Automated scripts in the background ensure that the interaction of all these tools runs smoothly.\n\nThis presentation reasons why Elephant Shed was created and shows the technical details and the advantages this appliance brings."}, {"EventID": "", "TalkTitle": "Kdenlive: From Beginner to Advanced Video Editing", "Room": "", "startTime": "14:45", "Date": "6-9", "FullName": "Michael Tunnell", "Talkdescription": "This talk is a guide to learn Kdenlive both at the beginner stage and advanced techniques. This will take you through learning the basics of how Kdenlive works like core functionality, avoiding the pitfalls of using Kdenlive, and advanced techniques to spice up your projects. Kdenlive is fantastic but it isn't perfect so this talk will show you the do's and don'ts of using Kdenlive. Once we've overcome the learning curve, then we'll look at some advanced techniques to really spice things up including high level transitioning."}, {"EventID": "", "TalkTitle": "SSH Authentication Using GPG Smart Cards", "Room": "", "startTime": "9:00", "Date": "6-8", "FullName": "Nick Bebout", "Talkdescription": "This talk will show how you can use GPG smart cards, such as the Yubikey 4 or the kernel concepts smart card for SSH authentication"}, {"EventID": "", "TalkTitle": "Never too Old for Arts & Crafts:  Custom PCB Basics", "Room": "", "startTime": "10:15", "Date": "6-9", "FullName": "Nicole Tobias", "Talkdescription": "Are you a hobbyist or developer that is in need of creating a custom printed circuit board (PCB) for a certain project, but are unsure of where to start?  Well, look no further than this talk.  In this talk, we will discuss various tips, techniques, and resources that I have picked up in developing custom PCBs for my embedded systems research.  These are nuggets of knowledge that you may find useful in order to create your own custom PCBs to make your little projects become a reality.  I will present some great resources for you to have at your fingertips and show how to create simple PCBs through EAGLE.  I will then share various pointers to keep in mind while designing your PCBs, and discuss where you can send these boards for fabrication.  Join me and discover just how achievable adding custom PCBs to your project can be.  This is Arts and Crafts for technology nerds and just as fun as that sounds!"}, {"EventID": "", "TalkTitle": "Professional Video Entirely on Linux", "Room": "", "startTime": "9:00", "Date": "6-10", "FullName": "Noah J. Chelliah", "Talkdescription": "What does it take to broadcast studio grade video entirely on Linux? From $100 setups to $25,000 setups we've done it all. Our network runs entirely on Linux and has the largest and most well known shows about Linux in the world.\n\nDo you have a passion and want to share it with the world? Find out how you can broadcast on Linux with any budget."}, {"EventID": "", "TalkTitle": "Linux Security Modules: Beyond File Permissions", "Room": "", "startTime": "11:30", "Date": "6-10", "FullName": "Parker Garrison", "Talkdescription": "If an attacker can exploit an application, they gain the full rights of the application.  Even if this application is running as a separate service account, for example, it can read any world-readable file.  Linux Security Modules are designed to provide isolation on a system by permitting very granular access to each object on the system.  This talk will examine how to set up existing open-source policies and quickly generate policies for a custom application, using security modules such as SELinux, AppArmor, and Smack."}, {"EventID": "", "TalkTitle": "Binary Exploitation: From Zero to Zero-Day", "Room": "", "startTime": "11:30", "Date": "6-8", "FullName": "Parker Garrison", "Talkdescription": "Any program written in a low-level language such as Assembly or C, including the entire Linux kernel, is vulnerable to buffer overflow attacks.  These attacks alter memory and take control of the instruction pointer to execute arbitrary code.  Various compile-time and runtime measures have been developed in an attempt to mitigate these attacks.  This talk will start with a proof of concept exploit against a simple vulnerable program, and alternately introduce mitigation measures and interactively provide PoCs of how they can be bypassed."}, {"EventID": "", "TalkTitle": "Windows Subsystem for Linux: Why bother?", "Room": "", "startTime": "13:30", "Date": "6-8", "FullName": "Patrick Wallek", "Talkdescription": "Are you forced to use a Windows computer (shudder) by your employer?  Do you wish you could have some Linux functionality on this computer?  Now you can.  I will discuss how to set up the Windows Subsystem for Linux (WSL) and the 3 different options of Linux this gives you.  I'll also cover some of the basic functionality available to you, installing additional Linux features, using GUI applications, and attempt to answer any questions you  may have."}, {"EventID": "", "TalkTitle": "Action-Domain-Responder: \"MVC\" for the Server Side", "Room": "", "startTime": "9:00", "Date": "6-9", "FullName": "Paul M. Jones", "Talkdescription": "Using Model-View-Controller as a pattern to describe stateless HTTP interactions has always been a bit of a kludge. There simply hasn't been a better pattern web applications -- until now.  ADR (Action-Domain-Responder) represents a replacement for generic MVC as an application architecture specifically tuned to the web. In this talk, we will discuss various patterns of overall application architecture, including MVC, MVP, PAC, DCI, RMR, and others. We will find out how the ADR pattern arises from generic MVC, and how it provides a better description of how web applications actually work. Finally, we will go over examples of how to architect an ADR application, as well as how to convert from an MVC architecture to an ADR one."}, {"EventID": "", "TalkTitle": "Python for Shell Scripting", "Room": "", "startTime": "10:15", "Date": "6-8", "FullName": "Peter Goss", "Talkdescription": "Shell scripting is a powerful feature but if your are like me you may find it hard to read or even get simple loops and conditionals to work properly and after getting it working it will never be changed. Python is a programming language that was designed around readability and has a 'batteries included' philosophy that means you can replace the functionality of most commands without much trouble. But, what if we could combine the two? We can! We have the technology! \n\nIn this talk I will cover how to call Linux commands from python, collect the output, and use that output in future commands. After getting a basic script running we can add more interesting features like command line arguments making a script 'pipeable' and (if time permits) using python's asyncio module to speed things up."}, {"EventID": "", "TalkTitle": "Performance Analysis and Troubleshooting Methodologies for Databases", "Room": "", "startTime": "11:30", "Date": "6-8", "FullName": "Peter Zaitsev", "Talkdescription": "Have you heard about USE Method  (Utilization - Saturation - Errors),   RED (Rate - Errors - Duration) or Golden Signals (Latency - Traffic - Errors - Saturations)? \n\nIn this presentation we will talk briefly about these different, but similar “focuses” and discuss how we can apply them to the data infrastructure performance analysis troubleshooting and monitoring.\n\nWe will use MySQL as example but most of the talk will apply to other database technologies as well."}, {"EventID": "", "TalkTitle": "MySQL Troubleshooting and Performance Optimization with PMM", "Room": "", "startTime": "13:30", "Date": "6-9", "FullName": "Peter Zaitsev", "Talkdescription": "Optimizing MySQL performance and troubleshooting MySQL problems are two of the most critical and challenging tasks for MySQL DBA’s. The databases powering your applications need to be able to handle heavy traffic loads while remaining responsive and stable so that you can deliver an excellent user experience. Further, DBA’s are also expected to find cost-efficient means of solving these issues.\n\nIn this presentation, we will discuss how you can optimize and troubleshoot MySQL performance and demonstrate how Percona Monitoring and Management (PMM) enables you to solve these challenges using free and open source software. We will look at specific, common MySQL problems and review the essential components in PMM that allow you to diagnose and resolve them."}, {"EventID": "", "TalkTitle": "MongoDB: Scaling it in production", "Room": "", "startTime": "14:45", "Date": "6-8", "FullName": "Peter Zaitsev", "Talkdescription": "At Percona, we started being the performance experts in MySQL; however in the past few years, we acquired a storage engine company that built an engine for both MySQL and MongoDB (Tokutek). This meant that we could participate in another database, and here is a laundry list of what we've done to make our customers successful running MongoDB in production. "}, {"EventID": "", "TalkTitle": "Open includes Users - Leverage their Input ", "Room": "", "startTime": "10:15", "Date": "6-8", "FullName": "Randy Earl", "Talkdescription": "To truly innovate, you need to intentionally seek diversity. This is well known to anyone who seriously participates in group collaboration, brainstorming sessions, and creative endeavors of all types. Indeed, the Open Source world already seems to be taking this as a given. For example, it was a significant theme from All Things Open keynotes for 2016, which included statements such as:\n- “Diversity has to be intentional” and\n- “You have to question your opinions in order to be open to others”\nThere is a great discussion around the value of building and encouraging diversity. However, the majority of that discussion thus far has been around the open source developer community – yet there are two sides to any interface. If you think of your application as a window to the world, then the users are the other half of that equation. In terms of sheer volume, users far outnumber contributors for your application. Intentionally building and engaging with a diverse user base can drive innovation and improve your software."}, {"EventID": "", "TalkTitle": "Contain(erize) Your Enthusiasm", "Room": "", "startTime": "11:30", "Date": "6-8", "FullName": "Robert Marshall", "Talkdescription": "Do you have tools that just clutter up your environment? Do you loathe installing 1001 ruby gems, pypi libraries, and npm modules just to do one simple task every once in a while?\nYou can eliminate all that hassle with containers and share your tooling setup with friends on any platform.\nContainers are heating up the data center and are about to break out into your desktop. No experience is required - we'll be starting from the scratch. We will also talk how containers will simplify packaging your application for all distributions."}, {"EventID": "", "TalkTitle": "Nobody Likes Lemonade", "Room": "", "startTime": "9:00", "Date": "6-9", "FullName": "Robert Marshall", "Talkdescription": "Impossible deadlines. Unreasonable asks. Insane working conditions. Some of us call that Tuesday.\nWearing a cape might make you look like a hero but, in the end, it's a recipe for disaster. We might know this but we do it anyway. We have to do better both for ourselves and for the people who count on us every day.\nLife may give us lemons - but we're all tired of lemonade. Let's try something new."}, {"EventID": "", "TalkTitle": "CI Know What I'm Doing", "Room": "", "startTime": "13:30", "Date": "6-8", "FullName": "Ryan W. O'Hara", "Talkdescription": "Your Continuous Integration setup is great but you can do better. I've been in the trenches of CI for a while and I want to share my experiences with you. What are some common pitfalls? Can testing be faster? Time is expensive so let's make the best of it. We'll be building bridges from \"worst practices\" to \"best practices\",  squeezing the most we can out of a CI environment, and discussing how Docker can mirror a production setup."}, {"EventID": "", "TalkTitle": "True Colors", "Room": "", "startTime": "13:30", "Date": "6-8", "FullName": "Sarah Henze", "Talkdescription": "This is an actionable approach to improving \"Emotional Intelligence\" and interpersonal interactions. Programs like Myers-Briggs focus on self analysis; True Colors builds on the concepts of MBTI type programs but moves the focus from self to how to read other people more effectively and respond to the way they work. \n\nParticipants can earn 2 CEUs for their PMP."}, {"EventID": "", "TalkTitle": "Domain trusts and You, Active Directory and FreeIPA", "Room": "", "startTime": "10:15", "Date": "6-8", "FullName": "Striker Leggette", "Talkdescription": "This talk will be about the benefits of configuring a domain trust between active directory and freeipa ldap and will include a live demonstration."}, {"EventID": "", "TalkTitle": "Mine Crypto on hardware you already own", "Room": "", "startTime": "13:30", "Date": "6-9", "FullName": "Trey Howard", "Talkdescription": "If you are like me - a computer nerd with hording tendencies, then you already have the hardware required to mine the cryptocurrency called Burst.  This cryptocurrency does not mine with expensive, noisy and power-hungy GPUs or ASICs.  Instead Burst uses the the common hard drive.\n\nMost cryptocurrencies use Proof of Work, a calculation done that proves that an immense number of calculations (aka work) went into creating it.  In Proof of Work systems, miners continuously run numbers through a hash function looking for inputs which produces outputs that satisfy some set of constraints. In Proof of Capacity, miners do this work once up-front (this is called plotting), and save the results to hard drives which they can continue to use for each block without the need to work continuously.\n\nMining is the act of using these plotted hard drives to power the network.  Then miners pull those Proofs off of the hard drive using a predetermined set of rules and submit them to the network. The end result is that the more hard drive space you contribute to the network, the more power you have over it.\n\nI will show how I used inexpensive hardware to setup an Ubuntu 16.04 server to mine Burst.  I will describe in detail the process to setup the following on linux:\n * the wallet - stores the blockchain and shows how much Burst you own\n * plotting - I plan to demo plotting on a small partition\n * mining - add that newly plotted partition and mine with it."}, {"EventID": "", "TalkTitle": "Bringing a nifi to a gun fight", "Room": "", "startTime": "16:00", "Date": "6-9", "FullName": "Wes Widner", "Talkdescription": "Do you have terabytes of malware to process? Do you want the most convoluted way to read your child a bedtime story? You're in luck! Nifi is an open source utility developed by the NSA that is highly versatile and scalable. I've recently discovered and have started using it to solve a wide range of problems and I'd like to provide a gentle introduction of it to you. \nYou can also think of this as the plumbing that needs to be done prior to employing machine learning on the finished data. Getting to this finished data is what data scientists hate and this tool makes getting there a lot less painful. If you're interested in becoming a data janitor and cleaning up the data swamp, this talk is for you!"}, {"EventID": "", "TalkTitle": "Using Let's Encrypt with Kubernetes Ingress Controllers", "Room": "", "startTime": "9:00", "Date": "6-8", "FullName": "Will Plusnick", "Talkdescription": "HTTPS is a requirement for modern web applications. Kubernetes is the standard for containerized app orchestration; Nginx ingress controllers are the easiest way to expose those applications to the outside web. This tutorial will show you how to use the free certificate authority Let's Encrypt with Nginx ingress controllers on Kubernetes to secure your applications using HTTPS.\n* A quick introduction to ingress controllers\n* A quick introduction to Let's Encrypt and the ACME protocol\n* A demo showing Let's Encrypt certificates being used with Nginx ingress controllers\n* Solutions we ran into while deploying in production\n* Time for Q&A"}, {"EventID": "", "TalkTitle": "Wifi Capability Deep Dive", "Room": "", "startTime": "11:30", "Date": "6-10", "FullName": "Zach Underwood", "Talkdescription": "The talk will be about the Distributed Wifi Capability Collector(DWCC) project and deep dive into some of the wifi specifications. I will show how you can see what features and specs your clients can support. When you know what your clients can support you can make wifi robust by supporting the features in your wireless network. "}]