[{"TalkTitle": "20 years of MySQL, 20 years of PHP, and 10 Years of SELF -- What the heck has been going on? ", "Room": "A", "Talk total": 0, "Positive": 0, "vote count": 0, "Negative": 0, "Neutral": 0, "startTime": "9:00", "TalkID": "A1", "Date": "6-8", "FullName": "Dave Stokes", "Talkdescription": "So what are the lessons of using MySQL and PHP for over twenty years now that we have reached the tenth anniversary of the Southeast Linux Fest? Besides the moonshine night and geeks with guns, why do normally reasonable folks return year after year to Charlotte to gather around open source software. Now we put computer services in a container but can we can not contain pop up ads! We can store all sorts of stuff on Github but why do I still get spammers commenting on old MySpace pages?  And what year will really be the year of the Linux Desktop?  Did we need Meltdown to warn of of impeding doom or did that come with systemd?  So if you like odd, quirky views with plenty of snark pointed at the computer industry please attend.  "}, {"TalkTitle": "Introducing the MySQL Document Store", "Room": "A", "Talk total": 0, "Positive": 0, "vote count": 0, "Negative": 0, "Neutral": 0, "startTime": "10:15", "TalkID": "A2", "Date": "6-8", "FullName": "Charles Bell, PhD", "Talkdescription": "Are you a fan of MySQL but have always wanted to leverage NoSQL in your applications? Until recently, that simply wasn't possible. However, the new MySQL Document Store feature support both SQL and NoSQL database paradigms. Don’t allow yourself to be forced into one paradigm or the other, but combine both approaches by using the Document Store feature that is new in MySQL 8!\n\nThis talk presents a host brand new tools and features that make creating a pure SQL, hybrid, or NoSQL solution far easier than ever before. Topics include a look at the components that make up the Document Store, using JSON documents with relational data, and building pure NoSQL solutions. You'll learn everything you need to get starting writing NoSQL applications for MySQL."}, {"TalkTitle": "Performance Analysis and Troubleshooting Methodologies for Databases", "Room": "A", "Talk total": 0, "Positive": 0, "vote count": 0, "Negative": 0, "Neutral": 0, "startTime": "11:30", "TalkID": "A3", "Date": "6-8", "FullName": "Peter Zaitsev", "Talkdescription": "Have you heard about USE Method  (Utilization - Saturation - Errors),   RED (Rate - Errors - Duration) or Golden Signals (Latency - Traffic - Errors - Saturations)? \n\nIn this presentation we will talk briefly about these different, but similar “focuses” and discuss how we can apply them to the data infrastructure performance analysis troubleshooting and monitoring.\n\nWe will use MySQL as example but most of the talk will apply to other database technologies as well."}, {"TalkTitle": "MySQL Without the SQL -- On My!", "Room": "A", "Talk total": 0, "Positive": 0, "vote count": 0, "Negative": 0, "Neutral": 0, "startTime": "13:30", "TalkID": "A4", "Date": "6-8", "FullName": "Dave Stokes", "Talkdescription": "Two percent of developers get any formal training in Structured Query Language and 98% percent wonder why their queries stink.  MySQL is introducing the Document Store to allow developers to code without needed to know SQL, define data structures, or involve a DBA. No longer do you need to embed an ugly string of SQL in your beautiful program.  The Document Store is built on the JSON data type and the new X DevAPI and even works with existing relational tables so you get the best of the NoSQL and SQL worlds on on proven technology platform."}, {"TalkTitle": "MongoDB: Scaling it in production", "Room": "A", "Talk total": 0, "Positive": 0, "vote count": 0, "Negative": 0, "Neutral": 0, "startTime": "14:45", "TalkID": "A5", "Date": "6-8", "FullName": "Peter Zaitsev", "Talkdescription": "At Percona, we started being the performance experts in MySQL; however in the past few years, we acquired a storage engine company that built an engine for both MySQL and MongoDB (Tokutek). This meant that we could participate in another database, and here is a laundry list of what we've done to make our customers successful running MongoDB in production. \n"}, {"TalkTitle": "Introducing MySQL InnoDB Cluster", "Room": "A", "Talk total": 0, "Positive": 0, "vote count": 0, "Negative": 0, "Neutral": 0, "startTime": "16:00", "TalkID": "A6", "Date": "6-8", "FullName": "Charles Bell, PhD", "Talkdescription": "Are you using MySQL in a high availability environment or maybe want to make your existing MySQL installation highly available? If you've tried it on your own, you may have had great success but with a higher than expected configuration and maintenance burden. That all changes with InnoDB Cluster. Do you want a single writer and many readers? Do you want multiple writers and readers? MySQL InnoDB Cluster can solve these problems and more.\n\nThis talk introduces the latest evolution of high availability features in MySQL, namely, the InnoDB Cluster and Group Replication. You will learn what comprises the InnoDB Cluster including how to quickly configure and maintain your cluster with the new MySQL Shell. You will also see the many benefits of using InnoDB Cluster including automatic failover and advanced replication configurations."}, {"TalkTitle": "MySQL/Percona Server/MariaDB Server security features overview", "Room": "A", "Talk total": 0, "Positive": 0, "vote count": 0, "Negative": 0, "Neutral": 0, "startTime": "9:00", "TalkID": "A7", "Date": "6-9", "FullName": "Colin Charles", "Talkdescription": "With MySQL 8, security models have changed (and they have been getting better since 5.6 & 5.7). This means there is diversion with MariaDB Server 10.0 and greater (being a fork). The bonus is that Percona Server for MySQL is quite close to MySQL (being a branch), but there are also security enhancements that one could benefit from. Come learn about them in this quick overview. \n\nSome topics covered, but not limited to:\n- Using TLS/SSL for connections\n- Using TLS/SSL with MySQL replication\n- Using external authentication plugins (LDAP, PAM, Kerberos)\n- Encrypting your data at rest \n- Monitoring your database with the audit plugins\n- Roles"}, {"TalkTitle": "ZFS and MySQL on Linux, The Sweet Spots", "Room": "A", "Talk total": 0, "Positive": 0, "vote count": 0, "Negative": 0, "Neutral": 0, "startTime": "10:15", "TalkID": "A8", "Date": "6-9", "FullName": "Jervin Real", "Talkdescription": "ZFS is the most advanced filesystem and volume management while MySQL is the most popular open source relational database. Within these ranks though, the two may not always be the best match. Percona's Jervin and Yves Trudeau has explored the use cases, configuration options, and strengths and weakneses. We find and lay out the sweet spots so you don't have to."}, {"TalkTitle": "The MySQL Ecosystem - understanding it, not running away from it!", "Room": "A", "Talk total": 0, "Positive": 0, "vote count": 0, "Negative": 0, "Neutral": 0, "startTime": "11:30", "TalkID": "A9", "Date": "6-9", "FullName": "Colin Charles", "Talkdescription": "MySQL is unique in many ways. It supports plugins. It supports storage engines. It is also owned by Oracle, thus birthing two branches of the popular opensource database: Percona Server and MariaDB. It also spawned a fork: Drizzle. You're a busy DBA having to maintain a mix of this. Or you're a CIO planning to choose one branch. How do you go about picking? Supporting multiple databases? Find out more in this talk.\n\nMySQL is a unique adult in many ways. It supports plugins. It supports storage engines. It is also owned by Oracle, thus birthing a branch and fork of the popular opensource database: Percona Server and MariaDB Server.\n\nYou're a busy DBA thinking about having to maintain a mix of this. Or you're a CIO planning to choose one branch over another. How do you go about picking? Supporting multiple databases? Find out more in this talk. Also covered is a deep-dive into what feature differences exist between MySQL/Percona Server/MariaDB Server. Within 20 minutes, you'll leave informed and knowledgable on what to pick.\n\nA base blog post to get started: https://www.percona.com/blog/2017/11/02/mysql-vs-mariadb-reality-check/"}, {"TalkTitle": "MySQL Troubleshooting and Performance Optimization with PMM", "Room": "A", "Talk total": 0, "Positive": 0, "vote count": 0, "Negative": 0, "Neutral": 0, "startTime": "13:30", "TalkID": "A10", "Date": "6-9", "FullName": "Peter Zaitsev", "Talkdescription": "Optimizing MySQL performance and troubleshooting MySQL problems are two of the most critical and challenging tasks for MySQL DBA’s. The databases powering your applications need to be able to handle heavy traffic loads while remaining responsive and stable so that you can deliver an excellent user experience. Further, DBA’s are also expected to find cost-efficient means of solving these issues.\n\nIn this presentation, we will discuss how you can optimize and troubleshoot MySQL performance and demonstrate how Percona Monitoring and Management (PMM) enables you to solve these challenges using free and open source software. We will look at specific, common MySQL problems and review the essential components in PMM that allow you to diagnose and resolve them."}, {"TalkTitle": "MySQL Windowing Functions", "Room": "A", "Talk total": 0, "Positive": 0, "vote count": 0, "Negative": 0, "Neutral": 0, "startTime": "14:45", "TalkID": "A11", "Date": "6-9", "FullName": "Dave Stokes", "Talkdescription": "MySQL 8 introduces Windowing Functions for better analytical queries.  You can now group multiple lines of data together (A time period, department, zipcode, etc.) and examine that group.  However this is an extremely complex tool that is not very well explained until now.  "}, {"TalkTitle": "Understanding the licensing of your database stack", "Room": "A", "Talk total": 0, "Positive": 0, "vote count": 0, "Negative": 0, "Neutral": 0, "startTime": "16:00", "TalkID": "A12", "Date": "6-9", "FullName": "Colin Charles", "Talkdescription": "What happens when a critical piece of database infrastructure gets relicensed? What alternatives do you have? databases are really for long term storage, and is your data protected for the foreseeable future? This talk will be largely focused on the MySQL ecosystem, in where you not only have software that is licensed traditionally with the GPLv2, GPLv3, but also a new Business Source License. \n\nIf you're a MariaDB MaxScale or MariaDB ColumnStore user, you'll definitely want to be in this talk, as it focuses on the changes and what you might be paying for. Remember, just being able to see the source code does not a license grant you!\n\nSee how MySQL (at Oracle) and Percona continue to do it right. There will be a discussion around some other popular OSS databases too."}, {"TalkTitle": "Herding Cats: Managing Users", "Room": "A", "Talk total": 0, "Positive": 0, "vote count": 0, "Negative": 0, "Neutral": 0, "startTime": "9:00", "TalkID": "A13", "Date": "6-10", "FullName": "Jason Edgecombe/Marshall Mark Hamrick", "Talkdescription": "This talk covers the tips, techniques, and lessons learned while working with users in an academic environment who don’t follow standards for various (often legitimate) reasons. We’ll share our perspectives on how we keep the users in check without having managerial authority."}, {"TalkTitle": "On Encrypting Email With GnuPG", "Room": "A", "Talk total": 0, "Positive": 0, "vote count": 0, "Negative": 0, "Neutral": 0, "startTime": "11:30", "TalkID": "A14", "Date": "6-10", "FullName": "James Richardson", "Talkdescription": "Encrypting email with GnuPG keeps it private and away from bulk surveillance. I will show breifly how to create a GnuPG key pair and configure Thunderbird/enigmail, mutt and emacs mail user agents to do send and receive encrypted email. "}, {"TalkTitle": "Automating your Red Team Infrastructure", "Room": "A", "Talk total": 0, "Positive": 0, "vote count": 0, "Negative": 0, "Neutral": 0, "startTime": "10:15", "TalkID": "A15", "Date": "6-10", "FullName": "Alex Rodriguez", "Talkdescription": "aptget update aptget upgrade -y aptget dist-upgrade -y...here we go again...and it failed...alright reinstall...\nI hate waiting for two hours when this process goes on. So in this talk I will show you how to keep your red teaming boxes up to date (automatically with packer). Then all you have to do is download a new image with vagrant box update to pull down the new image, and vagrant up to provision it (with ansible and also bash) how you like to and start up a fully updated box. Take the automation infrastructure to a new level for you red team or blue team. (This talk will specifically use Kali and other images for red teaming, but the sky is the limit even if you aren't a red teamer.)"}, {"TalkTitle": "GnuPG in corporate environment - best practices", "Room": "A", "Talk total": 0, "Positive": 0, "vote count": 0, "Negative": 0, "Neutral": 0, "startTime": "13:30", "TalkID": "A16", "Date": "6-10", "FullName": "Jean Pierre LeJacq", "Talkdescription": "GnuPG and the OpenPGP standard are the default encryption, signing, and key management software in the open source community. It is used for user authentication, email encryption, git commit signing, assuring integrity package management systems, and of document encryption.\n\nIn this talk we discuss best practices for using GnuPG in a corporate environment. We outline best practices for key management including proper creation of keys, revocation management, guaranteeing access to all encrypted corporate communication. The is an intermediate to advance talk that discuss many of the latest features of GnuPG."}, {"TalkTitle": "Regex or Regular Expressions", "Room": "A", "Talk total": 0, "Positive": 0, "vote count": 0, "Negative": 0, "Neutral": 0, "startTime": "14:45", "TalkID": "A17", "Date": "6-10", "FullName": "Kirk Carlson", "Talkdescription": "So you want to know how to harness the power of the Linux to search for text patterns in files. Regex is a mini language within many Linux tools that is used to specify search strings. This start of simple like find all occurrences of Rex Tillerson. Then it can be to find all Scandinavians named Rex. Then it could be to find a Scandinavians named R something with a doubled letter in their last name. This will talk about the basic syntax. How it is different for different tools ( vi, grep, sed). How to use a tool for expressing the syntax in English, since regex is generally considered to be a 'write-only' language."}, {"TalkTitle": "To Test or Not To Test", "Room": "A", "Talk total": 0, "Positive": 630, "vote count": 0, "Negative": 349, "Neutral": 328, "startTime": "18:00", "TalkID": "T1", "Date": "5-20", "FullName": "Testy Tester", "Talkdescription": "This is a test, this is only a tgest"}]